/** @file
  Strings for PciDeviceInfoSetupUtilityDxe.

;******************************************************************************
;* Copyright (c) 2023, Insyde Software Corp. All Rights Reserved.
;*
;* You may not reproduce, distribute, publish, display, perform, modify, adapt,
;* transmit, broadcast, present, recite, release, license or otherwise exploit
;* any part of this publication in any form, by any means, without the prior
;* written permission of Insyde Software Corp.
;*
;******************************************************************************
*/

#include "Standard.uni"

#string STR_EMPTY                                   #language en-US       ""

//
// Root Form
//
#string STR_ROOT_FORM_TITLE                         #language en-US       "PCI Device Information"

#string STR_SHOW_ACTUAL_DEVICE_NAME_PROMPT          #language en-US       "Show Actual Device Name"
#string STR_SHOW_ACTUAL_DEVICE_NAME_HELP            #language en-US       "If checked, it shows actual device name if available, otherwise the class name is presented."

#string STR_SHOW_DEVICE_TREE_PROMPT                 #language en-US       "Show Device Tree"
#string STR_SHOW_DEVICE_TREE_HELP                   #language en-US       "If checked, PCI/PCIe devices will be grouped by Root Port Number and listed as a tree-view."

#string STR_FILTERING_MODE_PROMPT                   #language en-US       "Filtering Mode"
#string STR_FILTERING_MODE_HELP                     #language en-US       "Select to show all device or PCI/PCIe Device only. Default is All Device."
#string STR_FILTERING_MODE_ALL_DEVICE               #language en-US       "All Device"
#string STR_FILTERING_MODE_PCI_DEVICE_ONLY          #language en-US       "PCI Device Only"
#string STR_FILTERING_MODE_PCIE_DEVICE_ONLY         #language en-US       "PCIe Device Only"

#string STR_FORM_REFRESH_PROMPT                     #language en-US       "Form Refresh"
#string STR_FORM_REFRESH_HELP                       #language en-US       "Form used in the refresh"

#string STR_FORMAT_PCI_DEVICE_HELP_STRING           #language en-US       "Device Type:  %s\n"
                                                                          "Device Path:  %s\n"
                                                                          "PCI Location: %s\n"
                                                                          "Slot Name:    %s\n"

//
// PCI Device Information Subform
//
#string STR_SUBFORM_TITLE                           #language en-US       "N/A"

#string STR_DEVICE_PATH_TEXT                        #language en-US       "Device Path"
#string STR_DEVICE_PATH_VALUE                       #language en-US       "N/A"
#string STR_DEVICE_PATH_HELP                        #language en-US       "Display the Device Path of this PCI/PCIe Device."

#string STR_PCI_LOCATION_TEXT                       #language en-US       "PCI Location"
#string STR_PCI_LOCATION_VALUE                      #language en-US       "N/A"
#string STR_PCI_LOCATION_HELP                       #language en-US       "Display the PCI Location of this PCI/PCIe Device. Numbers are displayed in hexdecimal."

#string STR_SLOT_NAME_TEXT                          #language en-US       "Slot Name"
#string STR_SLOT_NAME_VALUE                         #language en-US       "N/A"
#string STR_SLOT_NAME_HELP                          #language en-US       "Display the Slot Name defined by vendor."

#string STR_VENDOR_ID_TEXT                          #language en-US       "Vendor ID"
#string STR_VENDOR_ID_VALUE                         #language en-US       "N/A"
#string STR_VENDOR_ID_HELP                          #language en-US       "Display the Vendor ID of this PCI/PCIe Device."

#string STR_DEVICE_ID_TEXT                          #language en-US       "Device ID"
#string STR_DEVICE_ID_VALUE                         #language en-US       "N/A"
#string STR_DEVICE_ID_HELP                          #language en-US       "Display the Device ID of this PCI/PCIe Device."

#string STR_HEADER_TYPE_TEXT                        #language en-US       "Header Type"
#string STR_HEADER_TYPE_VALUE                       #language en-US       "N/A"
#string STR_HEADER_TYPE_HELP                        #language en-US       "Display the Header Type of this PCI/PCIe Device."

#string STR_CLASS_CODE_TEXT                         #language en-US       "Class Code"
#string STR_CLASS_CODE_VALUE                        #language en-US       "N/A"
#string STR_CLASS_CODE_HELP                         #language en-US       "Display the text interpretation of the Class Code of this PCI/PCIe Device."

#string STR_MAX_LINK_WIDTH_TEXT                     #language en-US       "Maximum Link Width"
#string STR_MAX_LINK_WIDTH_VALUE                    #language en-US       "N/A"
#string STR_MAX_LINK_WIDTH_HELP                     #language en-US       "Display the Maximum Link Width supported on this PCI/PCIe Device."

#string STR_CURRENT_LINK_WIDTH_TEXT                 #language en-US       "Current Link Width"
#string STR_CURRENT_LINK_WIDTH_VALUE                #language en-US       "N/A"
#string STR_CURRENT_LINK_WIDTH_HELP                 #language en-US       "Display the Current Link Width of this PCI/PCIe Device."

#string STR_MAX_LINK_SPEED_TEXT                     #language en-US       "Maximum Link Speed"
#string STR_MAX_LINK_SPEED_VALUE                    #language en-US       "N/A"
#string STR_MAX_LINK_SPEED_HELP                     #language en-US       "Display the Maximum Link Speed supported on this PCI/PCIe Device."

#string STR_CURRENT_LINK_SPEED_TEXT                 #language en-US       "Current Link Speed"
#string STR_CURRENT_LINK_SPEED_VALUE                #language en-US       "N/A"
#string STR_CURRENT_LINK_SPEED_HELP                 #language en-US       "Display the Maximum Link Speed of this PCI/PCIe Device."

#string STR_DISPLAY_CAP_INTPN_PROMPT                #language en-US       "Display Capability Interpretation"
#string STR_DISPLAY_CAP_INTPN_HELP                  #language en-US       "Decide to display interpretation for capabilities or not."

#string STR_PCI_CAPABILITIES                        #language en-US       "PCI Capabilities"
#string STR_PCIE_EXTENDED_CAPABILITIES              #language en-US       "PCIe Extended Capabilities"

#string STR_PCI_CAPABILITY_STRING_FORMAT            #language en-US       "%s (0x%02x)"
#string STR_PCI_CAPABILITY_STRING_HELP              #language en-US       "%s (0x%02x)\n"
                                                                          "Config Space Offset: 0x%02x\n"
#string STR_PCI_CAPABILITY_NO_STRING_FORMAT         #language en-US       "Capability ID (0x%02x)"
#string STR_PCI_CAPABILITY_NO_STRING_HELP           #language en-US       "Capability ID (0x%02x)\n"
                                                                          "Config Space Offset: 0x%02x\n"                                                                          
#string STR_PCI_EXT_CAPABILITY_STRING_FORMAT        #language en-US       "%s (0x%04x)"
#string STR_PCI_EXT_CAPABILITY_STRING_HELP          #language en-US       "%s (0x%04x)\n"
                                                                          "Config Space Offset: 0x%03x\n"
#string STR_PCI_EXT_CAPABILITY_NO_STRING_FORMAT     #language en-US       "Extended Capability ID (0x%04x)"
#string STR_PCI_EXT_CAPABILITY_NO_STRING_HELP       #language en-US       "Extended Capability ID (0x%04x)\n"
                                                                          "Config Space Offset: 0x%03x\n"                                                                          

#string STR_PCI_NO_CAPABILITY_STRING_PROMPT         #language en-US       "N/A"
#string STR_PCI_NO_CAPABILITY_STRING_HELP           #language en-US       "This device implement none of the capabilities"
